from main.main import main


def test_main():
    assert main() == ("08.12.2019 Открытие вклада\nСчет **5907\n41096.24 USD\n\n"
                      "07.12.2019 Перевод организации\nVisa Classic 2842 87** **** 9012 -> Счет **3655\n48150.39 USD\n\n"
                      "19.11.2019 Перевод организации\nMaestro 7810 84** **** 5568 -> Счет **2869\n30153.72 руб.\n\n"
                      "13.11.2019 Перевод со счета на счет\nСчет **9794 -> Счет **8125\n62814.53 руб.\n\n"
                      "05.11.2019 Открытие вклада\nСчет **8381\n21344.35 руб.\n\n")